Maxjta/zephyr/include/zephyr/dt-bindings/reset/at32f45x_reset.h
/*
 * Copyright (c) 2022 Teslabs Engineering S.L.
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#ifndef ZEPHYR_INCLUDE_DT_BINDINGS_RESET_AT32F45X_H_
#define ZEPHYR_INCLUDE_DT_BINDINGS_RESET_AT32F45X_H_

/**
 * Encode CRM register offset and configuration bit.
 *
 * - 0..5: bit number
 * - 6..14: offset
 * - 15: reserved
 *
 * @param reg CRM register name (expands to AT32_{reg}_OFFSET)
 * @param bit Configuration bit
 */
#define AT32_RESET_CONFIG(reg, bit) \
	(((AT32_ ## reg ## _OFFSET) << 6U) | (bit))

/**
 * @name Register offsets
 * @{
 */

#define AT32_AHB1RST_OFFSET       0x10U
#define AT32_AHB2RST_OFFSET       0x14U
#define AT32_AHB3RST_OFFSET       0x18U
#define AT32_APB1RST_OFFSET       0x20U
#define AT32_APB2RST_OFFSET       0x24U
#define AT32_ADDAPB1RST_OFFSET    0xE0U

/** @} */

/**
 * @name Clock enable/disable definitions for peripherals
 * @{
 */

/* AHB1 peripherals */
#define AT32_RESET_GPIOA      AT32_RESET_CONFIG(AHB1RST, 0)
#define AT32_RESET_GPIOB      AT32_RESET_CONFIG(AHB1RST, 1)
#define AT32_RESET_GPIOC      AT32_RESET_CONFIG(AHB1RST, 2)
#define AT32_RESET_GPIOD      AT32_RESET_CONFIG(AHB1RST, 3)
#define AT32_RESET_GPIOE      AT32_RESET_CONFIG(AHB1RST, 4)
#define AT32_RESET_GPIOF      AT32_RESET_CONFIG(AHB1RST, 5)
#define AT32_RESET_GPIOG      AT32_RESET_CONFIG(AHB1RST, 6)
#define AT32_RESET_GPIOH      AT32_RESET_CONFIG(AHB1RST, 7)
#define AT32_RESET_CRC        AT32_RESET_CONFIG(AHB1RST, 12)
#define AT32_RESET_DMA1       AT32_RESET_CONFIG(AHB1RST, 22)
#define AT32_RESET_DMA2       AT32_RESET_CONFIG(AHB1RST, 24)
#define AT32_RESET_EMAC       AT32_RESET_CONFIG(AHB1RST, 25)

/* AHB2 peripherals */
#define AT32_RESET_AES        AT32_RESET_CONFIG(AHB2RST, 4)
#define AT32_RESET_TRNG       AT32_RESET_CONFIG(AHB2RST, 6)
#define AT32_RESET_USBFS      AT32_RESET_CONFIG(AHB2RST, 7)
#define AT32_RESET_SDIO1      AT32_RESET_CONFIG(AHB2RST, 15)

/* AHB3 peripherals */
#define AT32_RESET_XMC        AT32_RESET_CONFIG(AHB3RST, 0)
#define AT32_RESET_QSPI1      AT32_RESET_CONFIG(AHB3RST, 1)

/* APB1 peripherals */
#define AT32_RESET_TIMER2     AT32_RESET_CONFIG(APB1RST, 0)
#define AT32_RESET_TIMER3     AT32_RESET_CONFIG(APB1RST, 1)
#define AT32_RESET_TIMER4     AT32_RESET_CONFIG(APB1RST, 2)
#define AT32_RESET_TIMER5     AT32_RESET_CONFIG(APB1RST, 3)
#define AT32_RESET_TIMER6     AT32_RESET_CONFIG(APB1RST, 4)
#define AT32_RESET_TIMER7     AT32_RESET_CONFIG(APB1RST, 5)
#define AT32_RESET_TIMER12    AT32_RESET_CONFIG(APB1RST, 6)
#define AT32_RESET_TIMER13    AT32_RESET_CONFIG(APB1RST, 7)
#define AT32_RESET_TIMER14    AT32_RESET_CONFIG(APB1RST, 8)
#define AT32_RESET_WWDT       AT32_RESET_CONFIG(APB1RST, 11)
#define AT32_RESET_SPI2       AT32_RESET_CONFIG(APB1RST, 14)
#define AT32_RESET_SPI3       AT32_RESET_CONFIG(APB1RST, 15)
#define AT32_RESET_USART2     AT32_RESET_CONFIG(APB1RST, 17)
#define AT32_RESET_USART3     AT32_RESET_CONFIG(APB1RST, 18)
#define AT32_RESET_USART4     AT32_RESET_CONFIG(APB1RST, 19)
#define AT32_RESET_USART5     AT32_RESET_CONFIG(APB1RST, 20)
#define AT32_RESET_I2C1       AT32_RESET_CONFIG(APB1RST, 21)
#define AT32_RESET_I2C2       AT32_RESET_CONFIG(APB1RST, 22)
#define AT32_RESET_I2C3       AT32_RESET_CONFIG(APB1RST, 23)
#define AT32_RESET_CAN1       AT32_RESET_CONFIG(APB1RST, 25)
#define AT32_RESET_CAN2       AT32_RESET_CONFIG(APB1RST, 26)
#define AT32_RESET_PWC        AT32_RESET_CONFIG(APB1RST, 28)
#define AT32_RESET_DAC        AT32_RESET_CONFIG(APB1RST, 29)
#define AT32_RESET_UART7      AT32_RESET_CONFIG(APB1RST, 30)
#define AT32_RESET_UART8      AT32_RESET_CONFIG(APB1RST, 31)

/* APB2 peripherals */
#define AT32_RESET_TIMER1     AT32_RESET_CONFIG(APB2RST, 0)
#define AT32_RESET_TIMER8     AT32_RESET_CONFIG(APB2RST, 1)
#define AT32_RESET_USART1     AT32_RESET_CONFIG(APB2RST, 4)
#define AT32_RESET_USART6     AT32_RESET_CONFIG(APB2RST, 5)
#define AT32_RESET_ADC1       AT32_RESET_CONFIG(APB2RST, 8)
#define AT32_RESET_ADC2       AT32_RESET_CONFIG(APB2RST, 9)
#define AT32_RESET_ADC3       AT32_RESET_CONFIG(APB2RST, 10)
#define AT32_RESET_SPI1       AT32_RESET_CONFIG(APB2RST, 12)
#define AT32_RESET_SPI4       AT32_RESET_CONFIG(APB2RST, 13)
#define AT32_RESET_SCFG       AT32_RESET_CONFIG(APB2RST, 14)
#define AT32_RESET_TIMER9     AT32_RESET_CONFIG(APB2RST, 16)
#define AT32_RESET_TIMER10    AT32_RESET_CONFIG(APB2RST, 17)
#define AT32_RESET_TIMER11    AT32_RESET_CONFIG(APB2RST, 18)
#define AT32_RESET_I2SF5      AT32_RESET_CONFIG(APB2RST, 20)
#define AT32_RESET_ACC        AT32_RESET_CONFIG(APB2RST, 29)
#define AT32_RESET_I2S2EXT    AT32_RESET_CONFIG(APB2RST, 30)
#define AT32_RESET_I2S3EXT    AT32_RESET_CONFIG(APB2RST, 31)

/** @} */

#endif /* ZEPHYR_INCLUDE_DT_BINDINGS_RESET_AT32F45X_H */
